collin80/esp32_can/src/mcp2515.cpp
  float speed = CAN_Bus_Speed;
  if (speed > 5000.0) speed *= 0.001;

  float NBT = 1.0 / (speed * 1000.0); // Nominal Bit Time - How long a single CAN bit should take

  //Now try each divisor to see which can most closely match the target.
  for(BRP=0; BRP < 63; BRP++) {
    TQ = 2.0 * (float)(BRP + 1) / (float)freqMhz;
    tempBT = NBT / TQ;
#ifdef DEBUG_SETUP
    SerialUSB.print("BRP: ");
    SerialUSB.print(BRP);
    SerialUSB.print("  tempBT: ");
    SerialUSB.println(tempBT);
#endif
    BT = (int)tempBT;
    if ( (tempBT - BT) < bestMatchf)
    {
        if (BT > 7 && BT < 25)
        {
            bestMatchf = (tempBT - BT);
            bestMatchIdx = BRP;
            savedBT = BT;
        }
    }
  }

  BT = savedBT;
  BRP = bestMatchIdx;
#ifdef DEBUG_SETUP  
  SerialUSB.print("BRP: ");
  SerialUSB.print(BRP);
  SerialUSB.print("  BT: ");
  SerialUSB.println(BT);
#endif
  
  byte SPT = (0.7 * BT); // Sample point
  byte PRSEG = (SPT - 1) / 2;
  byte PHSEG1 = SPT - PRSEG - 1;
  byte PHSEG2 = BT - PHSEG1 - PRSEG - 1;
#ifdef DEBUG_SETUP
  SerialUSB.print("PROP: ");
  SerialUSB.print(PRSEG);
  SerialUSB.print("  SEG1: ");
  SerialUSB.print(PHSEG1);
  SerialUSB.print("  SEG2: ");
  SerialUSB.println(PHSEG2);
#endif
  // Programming requirements
  if(PRSEG + PHSEG1 < PHSEG2) 
  {
      //SerialUSB.println("PRSEG + PHSEG1 less than PHSEG2!");
      return false;
  }
  if(PHSEG2 <= SJW) 
  {
      //SerialUSB.println("PHSEG2 less than SJW");
      return false;
  }
  
  uint8_t BTLMODE = 1;
  uint8_t SAMPLE = 0;
  
  // Set registers
  byte data = (((SJW-1) << 6) | BRP);
  Write(CNF1, data);
  Write(CNF2, ((BTLMODE << 7) | (SAMPLE << 6) | ((PHSEG1-1) << 3) | (PRSEG-1)));
  Write(CNF3, (B10000000 | (PHSEG2-1)));
  Write(TXRTSCTRL,0);

  Write(CNF1, data);
  delay(1);
  
  if(!autoBaud) {
    // Return to Normal mode
    if(!Mode(MODE_NORMAL)) 
    {
        //SerialUSB.println("Could not enter normal mode");
        return false;
    }
  } else {
    // Set to Listen Only mode
    if(!Mode(MODE_LISTEN)) 
    {
        //SerialUSB.println("Could not enter listen only mode");
        return false;
    }
  }
  // Enable all interupts
  Write(CANINTE,255);
  
  // Test that we can read back from the MCP2515 what we wrote to it
  byte rtn = Read(CNF1);
  if (rtn == data) return true;
  else 
  {
    //SerialUSB.println(data, HEX);
    //SerialUSB.println(rtn, HEX);
    return false;
  }

  return false;
}

uint16_t MCP2515::available()
{
  return uxQueueMessagesWaiting(rxQueue);
}

int MCP2515::_setFilter(uint32_t id, uint32_t mask, bool extended)
{
    uint32_t filterVal;
    boolean isExtended;

    for (int i = 0; i < 6; i++)
    {
        GetRXFilter(i, filterVal, isExtended);
        if (filterVal == 0) //empty filter. Let's fill it and leave
        {
            if (i < 2)
            {
                GetRXMask(MASK0, filterVal);
                if (filterVal == 0) filterVal = mask;
                filterVal &= mask;
                SetRXMask(MASK0, filterVal);
            }
            else
            {
                GetRXMask(MASK1, filterVal);
                if (filterVal == 0) filterVal = mask;
                filterVal &= mask;
                SetRXMask(MASK1, filterVal);
            }
            if (i < 3)
                SetRXFilter(FILTER0 + (i * 4), id, extended);
            else
                SetRXFilter(FILTER3 + ((i-3) * 4), id, extended);
            return i;
        }
    }

    //if we got here then there were no free filters. Return value of deaaaaath!
    return -1;
}

//we don't exactly have mailboxes, we have filters (6 of them) but it's the same basic idea
int MCP2515::_setFilterSpecific(uint8_t mailbox, uint32_t id, uint32_t mask, bool extended)
{
    uint32_t oldMask;
    if (mailbox < 2) //MASK0
    {
        GetRXMask(MASK0, oldMask);
        oldMask &= mask;
        SetRXMask(MASK0, oldMask);
        
    }
    else //MASK1
    {
        GetRXMask(MASK1, oldMask);
        oldMask &= mask;
        SetRXMask(MASK0, oldMask);
        
    }
    if (mailbox < 3)
        SetRXFilter(FILTER0 + (mailbox * 4), id, extended);
    else
        SetRXFilter(FILTER3 + ((mailbox-3) * 4), id, extended);
}

uint32_t MCP2515::init(uint32_t ul_baudrate)
{
    Init(ul_baudrate, 16);
}

uint32_t MCP2515::beginAutoSpeed()
{
    Init(0, 16);
}

uint32_t MCP2515::set_baudrate(uint32_t ul_baudrate)
{
    Init(ul_baudrate, 16);
}

void MCP2515::setListenOnlyMode(bool state)
{
    if (state)
        Mode(MODE_LISTEN);
    else Mode(MODE_NORMAL);
}

void MCP2515::enable()
{
    Mode(MODE_NORMAL);
}

void MCP2515::disable()
{
    Mode(MODE_SLEEP);
}

bool MCP2515::sendFrame(CAN_FRAME& txFrame)
{
    EnqueueTX(txFrame);
}

bool MCP2515::rx_avail()
{
    return available()>0?true:false;
}

uint32_t MCP2515::get_rx_buff(CAN_FRAME &msg)
{
    return GetRXFrame(msg);
}

void MCP2515::Reset() {
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_RESET);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

uint8_t MCP2515::Read(uint8_t address) {
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_READ);
  SPI.transfer(address);
  uint8_t data = SPI.transfer(0x00);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
  return data;
}

void MCP2515::Read(uint8_t address, uint8_t data[], uint8_t bytes) {
  // allows for sequential reading of registers starting at address - see data sheet
  uint8_t i;
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_READ);
  SPI.transfer(address);
  for(i=0;i<bytes;i++) {
    data[i] = SPI.transfer(0x00);
  }
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

CAN_FRAME MCP2515::ReadBuffer(uint8_t buffer) {
 
  // Reads an entire RX buffer.
  // buffer should be either RXB0 or RXB1
  
  CAN_FRAME message;
  
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_READ_BUFFER | (buffer<<1));
  uint8_t byte1 = SPI.transfer(0x00); // RXBnSIDH
  uint8_t byte2 = SPI.transfer(0x00); // RXBnSIDL
  uint8_t byte3 = SPI.transfer(0x00); // RXBnEID8
  uint8_t byte4 = SPI.transfer(0x00); // RXBnEID0
  uint8_t byte5 = SPI.transfer(0x00); // RXBnDLC

  message.extended = (byte2 & B00001000);

  if(message.extended) {
    message.id = (byte1>>3);
    message.id = (message.id<<8) | ((byte1<<5) | ((byte2>>5)<<2) | (byte2 & B00000011));
    message.id = (message.id<<8) | byte3;
    message.id = (message.id<<8) | byte4;
  } else {
    message.id = ((byte1>>5)<<8) | ((byte1<<3) | (byte2>>5));
  }

  message.rtr=(byte5 & B01000000);
  message.length = (byte5 & B00001111);  // Number of data bytes
  for(int i=0; i<message.length; i++) {
    message.data.byte[i] = SPI.transfer(0x00);
  }
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();

  return message;
}

