collin80/esp32_can/src/mcp2515.cpp
void MCP2515::Write(uint8_t address, uint8_t data) {
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_WRITE);
  SPI.transfer(address);
  SPI.transfer(data);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

void MCP2515::Write(uint8_t address, uint8_t data[], uint8_t bytes) {
  // allows for sequential writing of registers starting at address - see data sheet
  uint8_t i;
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_WRITE);
  SPI.transfer(address);
  for(i=0;i<bytes;i++) {
    SPI.transfer(data[i]);
  }
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

void MCP2515::SendBuffer(uint8_t buffers) {
  // buffers should be any combination of TXB0, TXB1, TXB2 ORed together, or TXB_ALL
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_RTS | buffers);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

void MCP2515::LoadBuffer(uint8_t buffer, CAN_FRAME *message) {
 
  // buffer should be one of TXB0, TXB1 or TXB2
  if(buffer==TXB0) buffer = 0; //the values we need are 0, 2, 4 TXB1 and TXB2 are already 2 / 4

  uint8_t byte1=0; // TXBnSIDH
  uint8_t byte2=0; // TXBnSIDL
  uint8_t byte3=0; // TXBnEID8
  uint8_t byte4=0; // TXBnEID0
  uint8_t byte5=0; // TXBnDLC

  if(message->extended) {
    byte1 = byte((message->id<<3)>>24); // 8 MSBits of SID
	byte2 = byte((message->id<<11)>>24) & B11100000; // 3 LSBits of SID
	byte2 = byte2 | byte((message->id<<14)>>30); // 2 MSBits of EID
	byte2 = byte2 | B00001000; // EXIDE
    byte3 = byte((message->id<<16)>>24); // EID Bits 15-8
    byte4 = byte((message->id<<24)>>24); // EID Bits 7-0
  } else {
    byte1 = byte((message->id<<21)>>24); // 8 MSBits of SID
	byte2 = byte((message->id<<29)>>24) & B11100000; // 3 LSBits of SID
    byte3 = 0; // TXBnEID8
    byte4 = 0; // TXBnEID0
  }
  byte5 = message->length;
  if(message->rtr) {
    byte5 = byte5 | B01000000;
  }
  
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_LOAD_BUFFER | buffer);  
  SPI.transfer(byte1);
  SPI.transfer(byte2);
  SPI.transfer(byte3);
  SPI.transfer(byte4);
  SPI.transfer(byte5);
 
  for(int i=0;i<message->length;i++) {
    SPI.transfer(message->data.byte[i]);
  }
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

uint8_t MCP2515::Status() {
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_STATUS);
  uint8_t data = SPI.transfer(0x00);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
  return data;
  /*
  bit 7 - CANINTF.TX2IF
  bit 6 - TXB2CNTRL.TXREQ
  bit 5 - CANINTF.TX1IF
  bit 4 - TXB1CNTRL.TXREQ
  bit 3 - CANINTF.TX0IF
  bit 2 - TXB0CNTRL.TXREQ
  bit 1 - CANINTFL.RX1IF
  bit 0 - CANINTF.RX0IF
  */
}

uint8_t MCP2515::RXStatus() {
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_RX_STATUS);
  uint8_t data = SPI.transfer(0x00);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
  return data;
  /*
  bit 7 - CANINTF.RX1IF
  bit 6 - CANINTF.RX0IF
  bit 5 - 
  bit 4 - RXBnSIDL.EIDE
  bit 3 - RXBnDLC.RTR
  bit 2 | 1 | 0 | Filter Match
  ------|---|---|-------------
      0 | 0 | 0 | RXF0
	  0 | 0 | 1 | RXF1
	  0 | 1 | 0 | RXF2
	  0 | 1 | 1 | RXF3
	  1 | 0 | 0 | RXF4
	  1 | 0 | 1 | RXF5
	  1 | 1 | 0 | RXF0 (rollover to RXB1)
	  1 | 1 | 1 | RXF1 (rollover to RXB1)
  */
}

void MCP2515::BitModify(uint8_t address, uint8_t mask, uint8_t data) {
  // see data sheet for explanation
  SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_BIT_MODIFY);
  SPI.transfer(address);
  SPI.transfer(mask);
  SPI.transfer(data);
  digitalWrite(_CS,HIGH);
  SPI.endTransaction();
}

bool MCP2515::Interrupt() {
  return (digitalRead(_INT)==LOW);
}

bool MCP2515::Mode(byte mode) {
  /*
  mode can be one of the following:
  MODE_CONFIG
  MODE_LISTEN
  MODE_LOOPBACK
  MODE_SLEEP
  MODE_NORMAL
  */
  BitModify(CANCTRL, B11100000, mode);
  delay(10); // allow for any transmissions to complete
  uint8_t data = Read(CANSTAT); // check mode has been set
  return ((data & mode)==mode);
}

/*Initializes all filters to either accept all frames or accept none
//This doesn't need to be called if you want to accept everything
//because that's the default. So, call this with permissive = false
//to state with an accept nothing state and then add acceptance masks/filters
//thereafter 
*/
void MCP2515::InitFilters(bool permissive) {
	uint32_t value;
	uint32_t value32;
	if (permissive) {
		value = 0;
        value32 = 0;
	}	
	else {
		value = 0x7FF; //all 11 bits set
        value32 = 0x1FFFFFFF; //all 29 bits set
	}
	SetRXMask(MASK0, value32);
	SetRXMask(MASK1, value);
	SetRXFilter(FILTER0, value32, 1);
	SetRXFilter(FILTER1, value32, 1);
	SetRXFilter(FILTER2, value, 0);
	SetRXFilter(FILTER3, value, 0);
	SetRXFilter(FILTER4, value, 0);
	SetRXFilter(FILTER5, value, 0);
}

/*
mask = either MASK0 or MASK1
MaskValue is either an 11 or 29 bit mask value to set 
Note that maskes do not store whether they'd be standard or extended. Filters do that. It's a little confusing
*/
void MCP2515::SetRXMask(uint8_t mask, uint32_t MaskValue) {
	uint8_t temp_buff[4];
	uint8_t oldMode;
	
	oldMode = Read(CANSTAT);
	Mode(MODE_CONFIG); //have to be in config mode to change mask
	
    temp_buff[0] = byte((MaskValue << 3) >> 24);
	temp_buff[1] = byte((MaskValue << 11) >> 24) & B11100000;
	temp_buff[1] |= byte((MaskValue << 14) >> 30);
	temp_buff[2] = byte((MaskValue << 16)>>24);
	temp_buff[3] = byte((MaskValue << 24)>>24);
	
	Write(mask, temp_buff, 4); //send the four byte mask out to the proper address
	
	Mode(oldMode);
}

/*
filter = FILTER0, FILTER1, FILTER2, FILTER3, FILTER4, FILTER5 (pick one)
FilterValue = 11 or 29 bit filter to use
ext is true if this filter should apply to extended frames or false if it should apply to standard frames.
Do note that, while this function looks a lot like the mask setting function is is NOT identical
It might be able to be though... The setting of EXIDE would probably just be ignored by the mask
*/
void MCP2515::SetRXFilter(uint8_t filter, uint32_t FilterValue, bool ext) {
	uint8_t temp_buff[4];
	uint8_t oldMode;
		
	oldMode = Read(CANSTAT);

	Mode(MODE_CONFIG); //have to be in config mode to change mask
	
