collin80/esp32_can/src/mcp2515.cpp
	if (ext) { //fill out all 29 bits
		temp_buff[0] = byte((FilterValue << 3) >> 24);
		temp_buff[1] = byte((FilterValue << 11) >> 24) & B11100000;
		temp_buff[1] |= byte((FilterValue << 14) >> 30);
		temp_buff[1] |= B00001000; //set EXIDE
		temp_buff[2] = byte((FilterValue << 16)>>24);
		temp_buff[3] = byte((FilterValue << 24)>>24);
	}
	else { //make sure to set mask as 11 bit standard mask
		temp_buff[0] = byte((FilterValue << 21)>>24);
		temp_buff[1] = byte((FilterValue << 29) >> 24) & B11100000;
		temp_buff[2] = 0;
		temp_buff[3] = 0;
	}
	
	Write(filter, temp_buff, 4); //send the four byte mask out to the proper address
	
	Mode(oldMode);
}

void MCP2515::GetRXFilter(uint8_t filter, uint32_t &filterVal, boolean &isExtended)
{
    uint8_t temp_buff[4];
	uint8_t oldMode;
		
	oldMode = Read(CANSTAT);

	Mode(MODE_CONFIG); //have to be in config mode to change mask

    Read(filter, temp_buff, 4);

    //these 11 bits are used either way and stored the same way either way
    filterVal = temp_buff[0] << 3;
    filterVal |= temp_buff[1] >> 5;
    isExtended = false;

    if (temp_buff[1] & B00001000) //extended / 29 bit filter - get the remaining 18 bits we need
    {
        isExtended = true;
        filterVal |= (temp_buff[1] & 3) << 27;
        filterVal |= temp_buff[2] << 19;
        filterVal |= temp_buff[3] << 11;
    }

	Mode(oldMode);
}

void MCP2515::GetRXMask(uint8_t mask, uint32_t &filterVal)
{
    uint8_t temp_buff[4];
	uint8_t oldMode;
		
	oldMode = Read(CANSTAT);

	Mode(MODE_CONFIG); //have to be in config mode to change mask

    Read(mask, temp_buff, 4);

    filterVal = temp_buff[0] << 3;
    filterVal |= temp_buff[1] >> 5;
    filterVal |= (temp_buff[1] & 3) << 27;
    filterVal |= temp_buff[2] << 19;
    filterVal |= temp_buff[3] << 11;

	Mode(oldMode);
}


//Places the given frame into the receive queue
void MCP2515::EnqueueRX(CAN_FRAME& newFrame) {
  xQueueSendFromISR(rxQueue, &newFrame, NULL);
}

//Places the given frame into the transmit queue
//Well, maybe. If there is currently an open hardware buffer
//it will place it into hardware immediately instead of using
//the software queue
void MCP2515::EnqueueTX(CAN_FRAME& newFrame) {
	uint8_t counter;
	uint8_t status = Status() & 0b01010100; //mask for only the transmit buffer empty bits
	
	//don't allow sending or queueing of frames if we're not properly initialized
	if (running == 0) {
		return;
	}
		
	if (status != 0b01010100) { //found an open slot
		if ((status & 0b00000100) == 0) { //transmit buffer 0 is open
			LoadBuffer(TXB0, &newFrame);
			SendBuffer(TXB0);
		}
		else if ((status & 0b00010000) == 0) { //transmit buffer 1 is open
			LoadBuffer(TXB1, &newFrame);
			SendBuffer(TXB1);
		}
		else { // must have been buffer 2 then.
			LoadBuffer(TXB2, &newFrame);
			SendBuffer(TXB2);
		}
	}
	else { //hardware is busy. queue it in software
    xQueueSend(txQueue, &newFrame, 0);
	}		
}

bool MCP2515::GetRXFrame(CAN_FRAME &frame) {
  if (xQueueReceive(rxQueue, &frame, 0) == pdTRUE) return true;
	return false;
}

void MCP2515::intHandler(void) {
    CAN_FRAME message;
    uint32_t ctrlVal;
    // determine which interrupt flags have been set
    uint8_t interruptFlags = Read(CANINTF);
    //Now, acknowledge the interrupts by clearing the intf bits
    Write(CANINTF, 0); 	
    
    if(interruptFlags & RX0IF)
    {
      // read from RX buffer 0
      message = ReadBuffer(RXB0);
      ctrlVal = Read(RXB0CTRL);
      handleFrameDispatch(&message, ctrlVal & 1);
    }
    if(interruptFlags & RX1IF)
    {
      // read from RX buffer 1
      message = ReadBuffer(RXB1);
      ctrlVal = Read(RXB1CTRL);
      handleFrameDispatch(&message, ctrlVal & 7);
    }
    if(interruptFlags & TX0IF)
    {
		  // TX buffer 0 sent
      if (uxQueueMessagesWaiting(txQueue)) {
        xQueueReceiveFromISR(txQueue, &message, 0);
			  LoadBuffer(TXB0, &message);
		   	SendBuffer(TXB0);
	    }
    }
    if(interruptFlags & TX1IF) 
    {
      if (uxQueueMessagesWaiting(txQueue)) {
        xQueueReceiveFromISR(txQueue, &message, 0);
			  LoadBuffer(TXB1, &message);
		   	SendBuffer(TXB1);
	    }
    }
    if(interruptFlags & TX2IF) 
    {
      if (uxQueueMessagesWaiting(txQueue)) {
        xQueueReceiveFromISR(txQueue, &message, 0);
			  LoadBuffer(TXB2, &message);
		   	SendBuffer(TXB2);
	    }
    }
    if(interruptFlags & ERRIF) {
      if (running == 1) { //if there was an error and we had been initialized then try to fix it by reinitializing
		  running = 0;
		  //InitBuffers();
		  //Init(savedBaud, savedFreq);
	  }
    }
    if(interruptFlags & MERRF) {
      // error handling code
      // if TXBnCTRL.TXERR set then transmission error
      // if message is lost TXBnCTRL.MLOA will be set
      if (running == 1) { //if there was an error and we had been initialized then try to fix it by reinitializing
		running = 0;
		//InitBuffers();
		//Init(savedBaud, savedFreq);
	  }	  
    }
}

void MCP2515::handleFrameDispatch(CAN_FRAME *frame, int filterHit)
{
  CANListener *thisListener;

  //First, try to send a callback. If no callback registered then buffer the frame.
  if (cbCANFrame[filterHit]) 
	{
    frame->fid = filterHit;
    xQueueSendFromISR(callbackQueueM15, frame, 0);
    return;
	}
	else if (cbGeneral) 
	{
    frame->fid = 0xFF;
    xQueueSendFromISR(callbackQueueM15, frame, 0);
    return;
	}
	else
	{
		for (int listenerPos = 0; listenerPos < SIZE_LISTENERS; listenerPos++)
		{
			thisListener = listener[listenerPos];
			if (thisListener != NULL)
			{
				if (thisListener->isCallbackActive(filterHit)) 
				{
					frame->fid = 0x80000000ul + (listenerPos << 24ul) + filterHit;
          xQueueSendFromISR(callbackQueueM15, frame, 0);
          return;
				}
				else if (thisListener->isCallbackActive(numFilters)) //global catch-all 
				{
					frame->fid = 0x80000000ul + (listenerPos << 24ul) + 0xFF;
          xQueueSendFromISR(callbackQueueM15, frame, 0);
          return;
				}
			}
		}
	} 
	//if none of the callback types caught this frame then queue it in the buffer
  xQueueSendFromISR(rxQueue, frame, NULL);
}
